openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Pwm.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/




#include <assert.h>
#include <string.h>

#include "Pwm.h"
#include "MemMap.h"
#include "Det.h"

#include "mpc55xx.h"

#include "Os.h"
#include "Mcu.h"
#if PWM_NOTIFICATION_SUPPORTED==STD_ON
#include "isr.h"
#include "irq.h"
#include "arc.h"
#endif

#if defined(CFG_MPC5604B)
	#define PWM_RUNTIME_CHANNEL_COUNT	56
    #define CHANNELS_OK (Channel <= PWM_MAX_CHANNEL-1)
#elif defined(CFG_MPC5606B)
	#define PWM_RUNTIME_CHANNEL_COUNT	64
    #define CHANNELS_OK (Channel <= PWM_MAX_CHANNEL-1)
#elif defined(CFG_MPC5606S)
	#define PWM_RUNTIME_CHANNEL_COUNT	48
    #define CHANNELS_OK (((Channel <= PWM_MAX_CHANNEL-1) && (Channel >= 40)) || ((Channel <= 23) && (Channel >= 16)))
#else
	#define PWM_RUNTIME_CHANNEL_COUNT	16
	#define CHANNELS_OK (Channel < 16)
#endif

const Pwm_ConfigType* PwmConfigPtr = NULL;

typedef enum {
	PWM_STATE_UNINITIALIZED, PWM_STATE_INITIALIZED
} Pwm_ModuleStateType;

static Pwm_ModuleStateType Pwm_ModuleState = PWM_STATE_UNINITIALIZED;

// Run-time variables
typedef struct {
	#if PWM_NOTIFICATION_SUPPORTED==STD_ON
		Pwm_EdgeNotificationType NotificationState;
	#endif
} Pwm_ChannelStructType;

// We use Pwm_ChannelType as index here
Pwm_ChannelStructType ChannelRuntimeStruct[PWM_RUNTIME_CHANNEL_COUNT];


/* Local functions */
Std_ReturnType Pwm_ValidateInitialized(Pwm_APIServiceIDType apiId)
{
	Std_ReturnType result = E_OK;
    if( Pwm_ModuleState == PWM_STATE_UNINITIALIZED )
    {
#if PWM_DEV_ERROR_DETECT==STD_ON
    	Det_ReportError(PWM_MODULE_ID,0, apiId,PWM_E_UNINIT);
    	result = E_NOT_OK;
#endif
    }
    return result;
}

Std_ReturnType Pwm_ValidateChannel(Pwm_ChannelType Channel,Pwm_APIServiceIDType apiId)
{
	Std_ReturnType result = E_OK;
    if( !CHANNELS_OK  )
    {
#if PWM_DEV_ERROR_DETECT==STD_ON
    	Det_ReportError(PWM_MODULE_ID,0, apiId,PWM_E_PARAM_CHANNEL);
    	result = E_NOT_OK;
#endif
    }
    return result;
}

void Pwm_InitChannel(Pwm_ChannelType Channel);
#if PWM_DE_INIT_API==STD_ON
void Pwm_DeInitChannel(Pwm_ChannelType Channel);
#endif

#if PWM_NOTIFICATION_SUPPORTED==STD_ON
static void Pwm_Isr(void);
#endif

static void calcPeriodTicksAndPrescaler(
				const Pwm_ChannelConfigurationType* channelConfig,
				uint16_t* ticks, Pwm_ChannelPrescalerType* prescaler) {

	uint32_t pre_global = 0;
	uint32_t f_in = 0;

#if defined(CFG_MPC560X)
	Pwm_ChannelType channel = channelConfig->channel;

	if(channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
		f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS_0 );
		pre_global = EMIOS_0.MCR.B.GPRE;
	} else {
		f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS_1 );
		pre_global = EMIOS_1.MCR.B.GPRE;
	}
#else
	f_in = McuE_GetPeripheralClock( PERIPHERAL_CLOCK_EMIOS );
	pre_global = EMIOS.MCR.B.GPRE;
#endif

  uint32_t f_target = channelConfig->frequency;

  Pwm_ChannelPrescalerType pre;
  uint32_t ticks_temp;

  if (channelConfig->prescaler == PWM_CHANNEL_PRESCALER_AUTO) {
    // Go from lowest to highest prescaler
    for (pre = PWM_CHANNEL_PRESCALER_1; pre <= PWM_CHANNEL_PRESCALER_4; pre++) {
      ticks_temp = f_in / (f_target * (pre_global + 1) * (pre + 1)); // Calc ticks
      if (ticks_temp > 0xffff) {
        ticks_temp = 0xffff;  // Prescaler too low
      } else {
        break;                // Prescaler ok
      }
    }
  } else {
    pre = channelConfig->prescaler; // Use config setting
    ticks_temp = f_in / (f_target * (pre_global + 1) * (pre+1)); // Calc ticks
    if (ticks_temp > 0xffff) {
      ticks_temp = 0xffff;  // Prescaler too low
    }
  }

  (*ticks) = (uint16_t) ticks_temp;
  (*prescaler) = pre;
}


static void configureChannel(const Pwm_ChannelConfigurationType* channelConfig){

	Pwm_ChannelType channel = channelConfig->channel;
	volatile struct EMIOS_tag *emiosHw;

#if defined(CFG_MPC560X)
	if(channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
		emiosHw = &EMIOS_0;
	} else {
		emiosHw = &EMIOS_1;
		channel -= PWM_NUMBER_OF_EACH_EMIOS;
	}
#else
	emiosHw = &EMIOS;
#endif

#if defined (CFG_MPC560X)
	emiosHw->CH[channel].CCR.B.MODE = channelConfig->mode;
	emiosHw->CH[channel].CCR.B.DMA = 0;
	emiosHw->CH[channel].CCR.B.BSL = channelConfig->clksrc;
	emiosHw->CH[channel].CCR.B.ODIS = 0;
#else
	emiosHw->CH[channel].CCR.B.MODE = PWM_EMIOS_OPWM;
	emiosHw->CH[channel].CCR.B.DMA = 0;
	emiosHw->CH[channel].CCR.B.BSL = 3;
	emiosHw->CH[channel].CCR.B.ODIS = 0;
#endif

	Pwm_ChannelPrescalerType prescaler;  uint16_t period_ticks;
	calcPeriodTicksAndPrescaler( channelConfig, &period_ticks, &prescaler );

	emiosHw->CH[channel].CBDR.R = period_ticks;
	emiosHw->CH[channel].CCR.B.UCPRE = prescaler;
#if defined (CFG_MPC560X)
	emiosHw->CH[channel].CCR.B.UCPEN = 1;
#else
	emiosHw->CH[channel].CCR.B.UCPREN = 1;
#endif

	// 0 A match on comparator A clears the output flip-flop, while a match on comparator B sets it
	// 1 A match on comparator A sets the output flip-flop, while a match on comparator B clears it
	// A duty cycle of X % should give a signal with state 'channelConfig->polarity' during
	// X % of the period time.
	emiosHw->CH[channel].CCR.B.EDPOL = (channelConfig->polarity == PWM_LOW) ? 1 : 0;
}

void Pwm_Init(const Pwm_ConfigType* ConfigPtr) {
    Pwm_ChannelType channel_iterator;

    /** @req PWM118 */
    /** @req PWM121 */
    if( Pwm_ModuleState == PWM_STATE_INITIALIZED ) {
#if PWM_DEV_ERROR_DETECT==STD_ON
    	Det_ReportError(PWM_MODULE_ID,0,PWM_INIT_ID,PWM_E_ALREADY_INITIALIZED);
#endif
    	return;
    }

    #if defined(CFG_MPC5606S) && !defined(CFG_MPC560XB)
		CGM.AC1_SC.R = 0x03000000; /* MPC56xxS: Select aux. set 1 clock to be FMPLL0 */
		CGM.AC2_SC.R = 0x03000000; /* MPC56xxS: Select aux. set 2 clock to be FMPLL0 */
	#endif
	
    #if PWM_DEV_ERROR_DETECT==STD_ON
        /*
         * PWM046: If development error detection is enabled for the Pwm module,
         * the function Pwm_Init shall raise development error PWM_E_PARAM_CONFIG
         * if ConfigPtr is a null pointer.
         *
         * PWM120: For pre-compile and link-time configuration variants, a NULL
         * pointer shall be passed to the initialization routine. In this case the
         * check for this NULL pointer has to be omitted.
         */
        #if PWM_STATICALLY_CONFIGURED==STD_OFF
            if (ConfigPtr == NULL) {
                Det_ReportError(PWM_MODULE_ID,0,PWM_INIT_ID,PWM_E_PARAM_CONFIG);
                return;
            }
        #endif
    #endif

    PwmConfigPtr = ConfigPtr;

	#if defined(CFG_MPC560X)
		/* Clock scaler uses system clock (~64MHz) as source, so prescaler 64 => 1MHz. */
		EMIOS_0.MCR.B.GPRE = PWM_PRESCALER_EMIOS_0 - 1;
		EMIOS_1.MCR.B.GPRE = PWM_PRESCALER_EMIOS_1 - 1;

		/* Enable eMIOS clock */
		EMIOS_0.MCR.B.GPREN = 1;
		EMIOS_1.MCR.B.GPREN = 1;

		/* Stop channels when in debug mode */
		EMIOS_0.MCR.B.FRZ = PWM_FREEZE_ENABLE;
		EMIOS_1.MCR.B.FRZ = PWM_FREEZE_ENABLE;

		/* Use global time base */
		EMIOS_0.MCR.B.GTBE = 1;
		EMIOS_1.MCR.B.GTBE = 1;
	#else
		/* Clock scaler uses system clock (~64MHz) as source, so prescaler 64 => 1MHz. */
		EMIOS.MCR.B.GPRE = PWM_PRESCALER - 1;

		/* Enable eMIOS clock */
		EMIOS.MCR.B.GPREN = 1;

		/* Stop channels when in debug mode */
		EMIOS.MCR.B.FRZ = PWM_FREEZE_ENABLE;

		/* Use global time base */
		EMIOS.MCR.B.GTBE = 1;
	#endif

    Pwm_ModuleState = PWM_STATE_INITIALIZED;

    for (channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++) {
    	const Pwm_ChannelConfigurationType* channelConfig = &ConfigPtr->Channels[channel_iterator];
    	Pwm_ChannelType channel = channelConfig->channel;

    	configureChannel( channelConfig );

        #if PWM_NOTIFICATION_SUPPORTED==STD_ON
                /*
                 * PWM052: The function Pwm_Init shall disable all notifications.
                 *
                 * This is now implemented in the configuration macro.
                 */
                // Pwm_DisableNotification(channel);

