openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Pwm.c
void inline Pwm_DeInitChannel(Pwm_ChannelType Channel) {
    Pwm_SetOutputToIdle(Channel);

	#if defined(CFG_MPC5516)
        // Set the disable bit for this channel
    	EMIOS.UCDIS.R |= (1 << (31 - Channel));
    #elif defined(CFG_MPC560X)
        // Set the disable bit for this channel
        if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1)
        {
        	EMIOS_0.UCDIS.R |= (1 << (Channel));
        }
        else
        {
        	EMIOS_1.UCDIS.R |= (1 << (Channel-PWM_NUMBER_OF_EACH_EMIOS));
        }
	#endif

    /*
     * PWM052: The function Pwm_DeInit shall disable all notifications.
     */
    #if PWM_NOTIFICATION_SUPPORTED==STD_ON
        Pwm_DisableNotification(Channel);
    #endif
}

void Pwm_DeInit() {
	Pwm_ChannelType channel_iterator;

	if(E_OK != Pwm_ValidateInitialized(PWM_DEINIT_ID))
	{
		return;
	}

	for (channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++) {
		Pwm_ChannelType channel = PwmConfigPtr->Channels[channel_iterator].channel;
		Pwm_DeInitChannel(channel);
	}

	// Disable module
	#if defined(CFG_MPC5516) || defined(CFG_MPC5567)
		EMIOS.MCR.B.MDIS = 1;
    #elif defined(CFG_MPC560X)
		EMIOS_0.MCR.B.MDIS = 1;
		EMIOS_1.MCR.B.MDIS = 1;
	#endif

	Pwm_ModuleState = PWM_STATE_UNINITIALIZED;
}
#endif


/*
 * PWM083: The function Pwm_SetPeriodAndDuty shall be pre compile time
 * changeable ON/OFF by the configuration parameter PwmSetPeriodAndDuty.
 */
#if PWM_SET_PERIOD_AND_DUTY_API==STD_ON
	void Pwm_SetPeriodAndDuty(Pwm_ChannelType Channel, Pwm_PeriodType Period,
			Pwm_DutyCycleType DutyCycle) {

		if ((E_OK != Pwm_ValidateInitialized(PWM_SETPERIODANDDUTY_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_SETPERIODANDDUTY_ID)))
		{
			return;
		}

		for (Pwm_ChannelType channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++)
		{
			if(Channel == PwmConfigPtr->Channels[channel_iterator].channel){
				if(PwmConfigPtr->ChannelClass[channel_iterator] != PWM_VARIABLE_PERIOD){
		#if PWM_DEV_ERROR_DETECT==STD_ON
					Det_ReportError(PWM_MODULE_ID,0, PWM_SETPERIODANDDUTY_ID, PWM_E_PERIOD_UNCHANGEABLE);
		#endif
					return;
				}
				break;
			}
		}

		volatile struct EMIOS_tag *emiosHw;
#if defined(CFG_MPC560X)
		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
			Channel -= PWM_NUMBER_OF_EACH_EMIOS;
		}
#else
		emiosHw = &EMIOS;
#endif

		uint16 leading_edge_position = (uint16) (((uint32) Period * (uint32) DutyCycle) >> 15);

		/* Timer instant for leading edge */
		emiosHw->CH[Channel].CADR.R = leading_edge_position;

		/* Timer instant for the period to restart */
		emiosHw->CH[Channel].CBDR.R = Period;
	}
#endif


/**
 * PWM013: The function Pwm_SetDutyCycle shall set the duty cycle of the PWM
 * channel.
 *
 * @param Channel PWM channel to use. 0 <= Channel < PWM_NUMBER_OF_CHANNELS <= 16
 * @param DutyCycle 0 <= DutyCycle <= 0x8000
 */
#if PWM_SET_DUTY_CYCLE_API==STD_ON
void Pwm_SetDutyCycle(Pwm_ChannelType Channel, Pwm_DutyCycleType DutyCycle)
{
	if ((E_OK != Pwm_ValidateInitialized(PWM_SETDUTYCYCLE_ID)) ||
		(E_OK != Pwm_ValidateChannel(Channel, PWM_SETDUTYCYCLE_ID)))
	{
		return;
	}
	volatile struct EMIOS_tag *emiosHw;
#if defined(CFG_MPC560X)
	if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
		emiosHw = &EMIOS_0;
	} else {
		emiosHw = &EMIOS_1;
		Channel -= PWM_NUMBER_OF_EACH_EMIOS;
	}
#else
	emiosHw = &EMIOS;
#endif

	uint16 leading_edge_position = (uint16) ((emiosHw->CH[Channel].CBDR.R
				* (uint32) DutyCycle) >> 15);

	/* Timer instant for leading edge */

	/*
	 * PWM017: The function Pwm_SetDutyCycle shall update the duty cycle at
	 * the end of the period if supported by the implementation and configured
	 * with PwmDutycycleUpdatedEndperiod. [ This is achieved in hardware since
	 * the A and B registers are double buffered ]
	 *
	 * PWM014: The function Pwm_SetDutyCycle shall set the output state according
	 * to the configured polarity parameter [which is already set from
	 * Pwm_InitChannel], when the duty parameter is 0% [=0] or 100% [=0x8000].
	 */
	emiosHw->CH[Channel].CADR.R = leading_edge_position;
}
#endif

#if  PWM_SET_OUTPUT_TO_IDLE_API == STD_ON
	void Pwm_SetOutputToIdle(Pwm_ChannelType Channel)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_SETOUTPUTTOIDLE_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_SETOUTPUTTOIDLE_ID)))
		{
			return;
		}
		volatile struct EMIOS_tag *emiosHw;
	#if defined(CFG_MPC560X)
		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
			Channel -= PWM_NUMBER_OF_EACH_EMIOS;
		}
	#else
		emiosHw = &EMIOS;
	#endif

		emiosHw->CH[Channel].CADR.R = 0;
    }
#endif
/*
 * PWM085: The function Pwm_GetOutputState shall be pre compile configurable
 * ON/OFF by the configuration parameter PwmGetOutputState
 */
#if PWM_GET_OUTPUT_STATE_API==STD_ON
	/*
	 * PWM022: The function Pwm_GetOutputState shall read the internal state
	 * of the PWM output signal and return it.
	 */
	Pwm_OutputStateType Pwm_GetOutputState(Pwm_ChannelType Channel)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_GETOUTPUTSTATE_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_GETOUTPUTSTATE_ID)))
		{
			return PWM_LOW;
		}

		volatile struct EMIOS_tag *emiosHw;
	#if defined(CFG_MPC560X)
		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
			Channel -= PWM_NUMBER_OF_EACH_EMIOS;
		}
	#else
		emiosHw = &EMIOS;
	#endif

		return (Pwm_OutputStateType)emiosHw->CH[Channel].CSR.B.UCOUT;
	}
#endif

#if PWM_NOTIFICATION_SUPPORTED==STD_ON

	void Pwm_DisableNotification(Pwm_ChannelType Channel)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_DISABLENOTIFICATION_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_DISABLENOTIFICATION_ID)))
		{
			return;
		}

		volatile struct EMIOS_tag *emiosHw;
	#if defined(CFG_MPC560X)
		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
			Channel -= PWM_NUMBER_OF_EACH_EMIOS;
		}
	#else
		emiosHw = &EMIOS;
	#endif

		// Disable flags on this channel
		emiosHw->CH[Channel].CCR.B.FEN = 0;
	}

	void Pwm_EnableNotification(Pwm_ChannelType Channel,Pwm_EdgeNotificationType Notification)
	{
		if ((E_OK != Pwm_ValidateInitialized(PWM_ENABLENOTIFICATION_ID)) ||
			(E_OK != Pwm_ValidateChannel(Channel, PWM_ENABLENOTIFICATION_ID)))
		{
			return;
		}

		volatile struct EMIOS_tag *emiosHw;
	#if defined(CFG_MPC560X)
		if(Channel <= PWM_NUMBER_OF_EACH_EMIOS-1) {
			emiosHw = &EMIOS_0;
		} else {
			emiosHw = &EMIOS_1;
			Channel -= PWM_NUMBER_OF_EACH_EMIOS;
		}
	#else
		emiosHw = &EMIOS;
	#endif

		ChannelRuntimeStruct[Channel].NotificationState = Notification;

		emiosHw->CH[Channel].CCR.B.FEN = 1;
	}

	static void Pwm_Isr(void)
	{
		// Find out which channel that triggered the interrupt
		#if defined (CFG_MPC5516)
			uint32_t flagmask = EMIOS.GFLAG.R;
		#elif defined(CFG_MPC5567)
			uint32_t flagmask = EMIOS.GFR.R;
        #endif

        #if defined(CFG_MPC5516) || defined(CFG_MPC5567)
			// There are 24 channels specified in the global flag register, but
			// we only listen to the first 16 as only these support OPWfM
			for (Pwm_ChannelType channel_iterator = 0; channel_iterator < PWM_NUMBER_OF_CHANNELS; channel_iterator++)
			{
				Pwm_ChannelType emios_ch = PwmConfigPtr->Channels[channel_iterator].channel;

				if (flagmask & (1 << emios_ch))
				{
					if (PwmConfigPtr->NotificationHandlers[channel_iterator] != NULL && EMIOS.CH[emios_ch].CCR.B.FEN)
					{
						Pwm_EdgeNotificationType notification = ChannelRuntimeStruct[emios_ch].NotificationState;
						if (notification == PWM_BOTH_EDGES ||

								notification == EMIOS.CH[emios_ch].CSR.B.UCOUT)
						{
							PwmConfigPtr->NotificationHandlers[channel_iterator]();
						}
					}

